[
  {
    "id": 1,
    "title": "Working Student - Software Development",
    "company": "Niedersächsische Staats- und Universitätsbibliothek Göttingen",
    "location": "Göttingen, Germany",
    "period": "Sep 2024 - Present",
    "description": "Supporting the development and maintenance of academic web portals using Next.js, assisting with code implementation, documentation, and testing.",
    "achievements": [
      "Developed and maintained 5+ reusable UI components for the digital library web portal using Next.js, improving code consistency and reusability.",
      "Assisted in writing technical documentation for 80% of newly implemented features, reducing onboarding time for new team members by 25%.",
      "Reviewed and tested approximately 5-7 pull requests per week, helping maintain code quality and reduce production bugs.",
      "Contributed to CI/CD improvements by automating 2+ small tasks, reducing deployment overhead by 15%.",
      "Helped implement bilingual (German/English) content management features for 100+ scholarly articles, improving accessibility for international users.",
      "Set up and maintained local development environments using Docker and ddev, reducing setup time for new contributors by 40%."
    ],
    "skills": ["Next.js", "Technical Documentation", "Code Review", "CI/CD", "Docker", "ddev", "Git", "GitLab"]
  },
  {
    "id": 2,
    "title": "Student Assistant - Department of Economics",
    "company": "Georg-August-Universität Göttingen",
    "location": "Göttingen, Germany",
    "period": "Feb 2024 - Present",
    "description": "Developing user-friendly economics experiments using frontend technologies and django-based oTree framework.",
    "achievements": [
      "Developing user friendly economics experiments using the frontend technologies and django based oTree framework",
      "Implementing chat and video communication features to enhance facilitating participant interaction, experimental realism and data collection",
      "Conducting data analysis for the experiments, employing statistical methods and visualization techniques to derive insights"
    ],
    "skills": ["Django", "oTree", "Frontend Technologies", "Data Analysis", "Statistical Methods", "Visualization"]
  },
  {
    "id": 3,
    "title": "Software Engineer",
    "company": "Tata Consultancy Services Private Limited",
    "location": "New Delhi, India",
    "period": "Sep 2021 - Apr 2023",
    "description": "Developed full-stack solutions for the PENALTY module of the Income Tax Business Application (ITBA).",
    "achievements": [
      "Developed full-stack solutions for the PENALTY module of the Income Tax Business Application (ITBA) using HTML, CSS, JavaScript, Java, PL/SQL, and Oracle Database, resulting in a 20% increase in user engagement and a 15% reduction in processing time for tax filings",
      "Implemented complex business logic and dynamic functionalities in the back-end by writing optimized Java code integrated with Oracle database",
      "Designed and executed database queries, PL/SQL procedures, triggers, and functions, optimizing data models and achieving an 18% reduction in database response time to enhance UI responsiveness",
      "Leveraged Agile methodologies to iteratively develop and deploy functionalities, resulting in 9 successful change requests and 3 new functionalities released in a fast-paced environment, consistently aligned with evolving user requirements"
    ],
    "skills": ["HTML", "CSS", "JavaScript", "Java", "PL/SQL", "Oracle Database", "Agile"]
  }
]